app/controllers/medical_recommendations_controller.rb

  def create
    @medical_recommendation = @user.build_medical_recommendation(medical_recommendation_params)

    if @medical_recommendation.save
---
INSERT INTO "medical_recommendations" ("user_id", "number", "issuer", "state", "expiration_date", "image_path", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"