app/controllers/state_ids_controller.rb

  def create
    @state_id = @user.build_state_id(state_id_params)

    if @state_id.save
---
INSERT INTO "state_ids" ("user_id", "number", "state", "expiration_date", "image_path", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"